[
    {
        "uri": "/_index",
        "content": "---\ntitle: Home\nimage: /img/homepagebg.png\n---\n\n",
        "tags": []
    },
    {
        "uri": "/about/_index",
        "content": "---\ntitle: About\nimage: /img/celebrity-20161003230555-calma2cjuancarlo.jpg\nheadline: Carlo Calma Consultancy Inc.\nsubheadline: 2009 onwards\nportfolio_pdf: /img/portfolio123.pdf\n---\nCarlo Calma Consultancy Inc. was incubated in 2009 for the need to push boundaries in design thinking, architectural practice and construction spearheaded by a diverse team of theorists, artists, architects and engineers.\n\nThe philosophy of the company looks at the potentials creative effort, local-engagement, client-response, and contexts of sites and spaces as either cultural phenomena or gearing towards Filipino identity. With locality and sensitive underlay of programmatic indexes and matrix we create architectural fictions and address issues in both corporate and private realm. This new way of thinking os creating news waves of enthusiastic architects to create new types of living, enigmatic resort spaces, new found objects turned bespoke apartments, seeds for change with commercial aspect - meaning creating a typology that is a dream turned into a reality.\n\nWe harness Filipino skills and ingenuity and craftsmanship - we encourage a path of encouragement with rigor, containment and locality. We continue to produce works of quality, excellence and with attention to details to further question the discourse of the analog and the digital.\n\n Clipp Center, 5th floor, 39th street corner 11th avenue,\n\n Fort Bonifacio Global City, Taguig City 1201 Philippines\n\nstudio@carlocalmaconsultancy.com +639178503912\n",
        "tags": []
    },
    {
        "uri": "/process/architectural-model-making-techniques",
        "content": "---\ntitle: Architectural Model Making Techniques\ndate: '2018-05-19T18:12:32+08:00'\nyoutubeVideoId: itD5U_WIqao\n---\n\n",
        "tags": []
    },
    {
        "uri": "/process/architecture-career",
        "content": "---\ntitle: Architecture Career\ndate: '2018-05-19T18:36:55+08:00'\nyoutubeVideoId: ImTTW94ZicM\n---\n\n",
        "tags": []
    },
    {
        "uri": "/process/architecture-short-course",
        "content": "---\ntitle: 'Coral World Park '\ndate: '2018-05-19T18:12:32+08:00'\nyoutubeVideoId: 'https://youtu.be/7MES39YnQ60'\n---\n\n",
        "tags": []
    },
    {
        "uri": "/process/architecture-vlog",
        "content": "---\ntitle: The Monument by Carlo Calma Consultancy\ndate: '2018-05-19T18:15:25+08:00'\nyoutubeVideoId: 'https://youtu.be/rUmORZ9GcLs'\n---\n\n",
        "tags": []
    },
    {
        "uri": "/process/inside-zedd",
        "content": "---\ntitle: Coral World Marina\ndate: '2018-05-19T18:12:32+08:00'\nyoutubeVideoId: 'https://youtu.be/ogfvO-nPCZI'\n---\n\n",
        "tags": []
    },
    {
        "uri": "/process/why-make-architecture-models",
        "content": "---\ntitle: Cojones Resort\ndate: '2018-05-19T18:14:45+08:00'\nyoutubeVideoId: 'https://youtu.be/JIqksi6GAHg'\n---\n\n",
        "tags": []
    },
    {
        "uri": "/search",
        "content": "",
        "tags": []
    },
    {
        "uri": "/search/_index",
        "content": "---\nlayout: search\ntitle: Search Results\npermalink: /search/\ncategories: [\"Search\"]\ntags: [\"Index\"]\nnoToc: true\n---",
        "tags": []
    },
    {
        "uri": "/works/boolean-house",
        "content": "---\ntitle: Boolean House\ndate: '2013-06-04T10:25:21+08:00'\nheadline: Boolean house\nsubheadline: Davao 2015\nimage: /img/boolean-house.jpg\n---\nA young couple approached the studio to create a space that is similar to their lifestyle of enjoying resort living. We wanted to create spaces that stack together with individual catered spaces for every family member. The heart of the project is that every room caters to the needs of the client. The couple wanted loft spaces while enjoying views of the pool. The daughter has fashion catwalk dressing room for her infinity to clothes and creating a diaspora of trajectory of mirrored spaces. The son having a mixed use living and working spaces as if boxes are intertwined with music room which the man of the house shares the same passion. The cool features of the house is really this exploded sticks that jots up in the house that becomes the chandelier at night, the very subliminal window view when submerged in the pool where you are swimming beside a sea of carps, and this very big brother surveillance beam that acts as both a “peeping tom” and a kind of architectural artifact that is the miniature version of the “light exploded chandelier.” These microscopic details in both void spaces in different scales in terms of viewing make this house not only a house of deduction but a house of sensual vantage points and projections.\n",
        "tags": []
    },
    {
        "uri": "/works/brutalist-house",
        "content": "---\ntitle: Brutalist House\ndate: '2018-05-05T18:05:12+08:00'\nheadline: Brutalist House\nsubheadline: Istanbul 2015\nimage: /img/brutalist-house.jpg\n---\nA couple that are film enthusiast approached the studio to create a dramatic diorama of the film, “Iron Man.” We were shocked but at the same time interested in the inception of a project from a movie. I thought it was quite thought provoking and different. The concept was to create a house inspired by Brutalism – meaning the concrete rawness, the disparity between construction and function – all of these were case studies from the great Louis Kahn, Carlo Scarpa, and even socialist architectural movement in Brasilia such as Lina Bo Bardi – in this investigation this is a project of materiality. What we wanted really was to see the “skeletons” of the building; At first glance this minimalist house seemed arbitrary – but a concrete slab that was scanned and re-interpreted as a façade element inspired the perforated metal sheet. Rawness, irregularities, roughness and smoothness and sometimes anomalies in decay become the inspiration. The façade has its whimsy character to the rust steel tree assemblage looking like re-purposed bicycles seemed dropping in gravity, the waterfall feature with its chrome exterior but acts kind of montage of choreographing water. The most sensual of all of this architectural tectonics is really the peeling of the ceiling and its thinness and showing that the skeleton is more important than the skin. And if we go back to movie metaphors, as if a new Frankenstein monster was created – and it’s the very sensual and sensitive kind.\n",
        "tags": []
    },
    {
        "uri": "/works/emerald-house",
        "content": "---\ntitle: Emerald House\ndate: '2018-05-05T16:04:26+08:00'\nheadline: Emerald House\nsubheadline: Manila 2018\nimage: /img/emeraldhouse.jpg\n---\nThe studio is immersed with local east culture – we are challenged that lots of Asian clients that do believe the scientific and some would argue folklore of the belief of “fengshui” (placement of things, objects and spaces) – as we continue to research this topic and identify – Democratically, I can say there are parallel philosophies in ventilation, earth atmosphere studies in lighting – and abstract notions of ideas that cant be seen such as – sweat, humidity, air particles whether hot (caused by machines) and cold (caused also by not only machines but also human conditions) – all of this and more are actually architectural conditions that began to study not only the relationship of human beings to the environment but also other phenomena such as but not exclusive to star alignment, horoscope and numerology. This psyche of human perception, permutations and genealogy interests us not only in the human scale but also in the larger context in our population. This project begins to explore in lucky colors not that saturated in space but a define thesis of the project. Emerald green divined by their trusted “fengshui-master” – we used this color in the gate and the focal point of the house which is this floating staircase emulating a “Dragon” – which is again the dominant sign of the inhabitants. The use of matte, glossy, satin tones of emerald green was the strategy – percentage of sheens create these spaces of multi-sensory and shadow play. Every room is distinct and creates remnants of this devoured emerald aggregate – the main masters bedroom has a peephole that creates this kaleidoscopic effect, the room of the only daughter who is a jetsetter goes back to cave scenarios that looks like stalagmites and stalactites – that this jotted cylinder geometries not only mimic these investigations but actually become real functional paraphernalia such as lighting and shower. This intimacy that is inspired in nature is like a microscopic view of this gemstones with interesting fissures. The house is timid outside but as you enter and open this Pandora’s box – there is more to it than its white austere façade – it glows at its core – fetishizing the object that has qualities of curiosity as well as luxuriousness.\n",
        "tags": []
    },
    {
        "uri": "/works/infinity-house",
        "content": "---\ntitle: Infinity House\ndate: 2018-06-11T04:44:54.341Z\nheadline: Infinity House\nsubheadline: '2018'\nimage: /img/infinityhouse.jpg\n---\nINFINITY HOUSE\r\n\n\r\n\nIs this a house or an object? A series of mockups-turned-sculptures are inspirations of this house. Our studio is inspired with everyday objects – sometimes we make models that seem unreal but actually real. This deliberate approach to its intuitive process and where the idea of the sketch whether analog or digital becomes the driving force of design, As your mouse touches this software it’s a deliberate act of a sketch – it has logical data and parameters but there are also a will of elusive process that goes outside the realm of the digital, This two-part-process – the very non-linear approach is the heart of our studio – we are knowledgeable with technology but also sensitive in the cultural, locality, and the deliberate chance of introducing scenarios, everyday objects, social media, political agenda, Filipino pop-culture meme – or just being really inspired in our travels, where we live in, people we meet and even a certain moment – we thrive the imperfection of humanity as a catalyst of inspiration and change. For this house – the manifesto is actually a house of the didactic clientele finding meaning in everything and everywhere. Just like how it was just an object – it will always be an object – a paradoxical container for future living and the quest of the unknown.\n",
        "tags": []
    },
    {
        "uri": "/works/neque-porro-quisquam",
        "content": "---\ntitle: Galvanized House\ndate: '2009-05-30T00:00:00+08:00'\nheadline: Galvanized House\nsubheadline: Nullam 2009\nimage: /img/galvanized-house.jpg\n---\nAn avid music connoisseur marries a contemplative and soft housewife – it equals – an embodiment of bold design but with pastels and hues emulating skies and forest. The house was inspired by the typical houses in shanty towns – the standard galvanized house – how can a generic typology of the house be different in the modern times or adapt to its current site condition – these where the questions we wanted to put out when designing this very liberal house. You are happy when you get a client and they tell you – you can do whatever you want? But for the more matured designer someone should know to have a certain restraint. The house was to make something that is everyday a bit luxurious (or to sheer away that this material is less of a material because its everywhere and cheap) – what we wanted to do was to introduce that this material has its performative aspect such as slowing down and canalizing water. What we wanted to create as well that a house could be masculine with splashes of pastels. With its open plan and set back of water in the ground floor there’s already a feeling that is somewhat an island – complex alcove ceiling design is predominant in the house but this pop gives an interface in movement and to create the separation of spaces but without walls. Another highlight is the master’s bedroom with a balcony where you can see the overgrowing skyline of Makati City. The interiors are designed to create fluidity blurring the boundaries of wall, floor and ceiling.\n",
        "tags": []
    },
    {
        "uri": "/works/vivamus-ultricies-sodales-gravida",
        "content": "---\ntitle: Envelope House\ndate: '2011-05-15T00:00:00+08:00'\nheadline: Envelope House\nsubheadline: Vestibulum 2011\nimage: /img/envelope-house.jpg\n---\nAn adventure couple addressed the studio – they were open-minded and free-spirited. We wanted to engulf the same virtues of the inhabitants. With a very long lot length and façade (two lots combined) but with very narrow in width – similar to the iconic Flatiron Building in New York but with different context – Our question as designers was how to create a dramatic and grand entry-point with such a narrow lot. What we did was to create this long and determined ramp as entrance and enveloping the contained spaces – using the parameter of the building restrictions having a certain angle – we created this envelope house. Contained spaces with different programmes are stacked together – a bridge was made to connect the master’s bedroom but also acts as a double height space to create the illusion of expansion. With the chosen materials, we can distinguish the white walls that merge with ceiling as it spirals into cove-lighting effect. The top ceiling part is made of a wood veneer hovering the space. All the rooms are specifically designed to clients-response and moreover, the man of the house who is actually a pilot – the enveloping of ramp turned wall to roof and back wall again and landscape looks like a plane that is about to take off – a kind of an architectural pun and onomatopoeia – since its near the airport and gushing of winds and electric sounds is part of the local atmospheric effects. In my vista, I can hear the theme song of Top Gun.\n",
        "tags": []
    }
]